{
    "general": {
        "name": "Alan Antonio Ruiseco Cisneros",
        "title": "Software Engineer",
        "about": "Software engineer with experience in across several roles, I love specially work with infrastructure and find innovating solutions that can help to automate process",
        "phone": "8713478759",
        "email": "alan_antoniorc@outlook.com"
    },
    "experience": [{
            "company": "Luxoft",
            "title": "DevOps",
            "startDate": "07/19/2021",
            "endDate": "Actuality",
            "description": [
                "Taking care of the Jenkins pipelines to deploy the services, monitor and troubleshoot any issue",
                "that might arise that affecter either the continuous delivery or production.",
                "Help developers on onboarding process of the projects into Spinnaker new deploy and release standards",
                "for kubernetes.",
                "Create ECS deployments with Jenkins",
                "for web applications and microservices.",
                "Monitor,",
                "troubleshoot and fix the vulnerabilities found in the packages versions used in the projects.",
                "Correct and prevent attacks configuring the redirection and protection of the web applications with Akamai.",
                "Managing AWS infrastructure through IaC with Terraform.",
                "Bash scripting to manage,",
                "troubleshoot and automate process.common tasks across multiple instances.",
                "Keep updated packages and dependencies on instances in order to fix vulnerabilities.",
                "Mentoring new team members on the common tasks from the team,",
                "and also providing knowledge transfer over the applications stack.",
                "Collaborate with the implementation of new technologies like CDK as new IaC framework."
            ]
        },
        {
            "company": "Softtek",
            "title": "Software Developer",
            "startDate": "07/16/2021",
            "endDate": "03/01/2021",
            "description": [
                "Developed an ETL workflow to interconnect a third party tool and provide data using Serverless to build the Step Functions",
                "to orchestrate several Node Js AWS Lambdas over AWS,",
                "Used docker-compose to generate a template to emulate AWS locally using Localstack."
            ]
        }
    ]
}